<a href="https://colab.research.google.com/github/MuhammadAgungMahardhika/big-data/blob/main/BigData2_absen_genap_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**INSTALLASI DAN PENGGUNAAN PANDAS**

Untuk menginstall Pandas, kita bisa mengimport dan cek versinya

In [ ]:
import pandas
pandas.__version__

'1.1.5'

Sama seperti kita biasanya mengimpor NumPy di bawah alias np, kita akan mengimpor Pandas di bawah
alias pd:

In [ ]:
import numpy as np
import pandas as pd

**Memperkenalkan Objek Pandas**

**The Pandas Series Object**

Seri Pandas adalah larik satu dimensi dari data yang diindeks. Itu dapat dibuat dari a
daftar atau larik sebagai berikut:

In [ ]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

Seperti yang kita lihat pada keluaran sebelumnya, Seri membungkus urutan nilai dan a
urutan indeks, yang dapat kita akses dengan nilai dan atribut indeks. Itu
nilai hanyalah array NumPy yang sudah dikenal:

In [ ]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

Indeks adalah objek mirip larik berjenis pd.Index, yang akan kita bahas lebih detail
sesaat:

In [ ]:
data.index

RangeIndex(start=0, stop=4, step=1)

Seperti dengan array NumPy, data dapat diakses oleh indeks terkait melalui familiar
Notasi kurung siku Python:

In [ ]:
data[1]

0.5

In [ ]:
data[1:3]

1    0.50
2    0.75
dtype: float64

Seperti yang akan kita lihat, Seri Pandas jauh lebih umum dan fleksibel daripada
array NumPy satu dimensi yang diemulasinya.

**Series as generalized NumPy array**

Definisi indeks eksplisit ini memberikan kemampuan tambahan pada objek Seri. Misalnya, indeks tidak harus berupa bilangan bulat, tetapi dapat terdiri dari nilai apa pun yang diinginkan
Tipe. Misalnya, jika kita mau, kita bisa menggunakan string sebagai indeks:

In [ ]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

Dan akses item berfungsi seperti yang diharapkan:

In [ ]:
data['b']

0.5

Kita bahkan dapat menggunakan indeks yang tidak bersebelahan atau tidak penting:

In [ ]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=[2, 5, 3, 7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [ ]:
data[5]

0.5

**Series as specialized dictionary**

Kita dapat membuat analogi Seri-sebagai-kamus menjadi lebih jelas dengan membuat sebuah Objek seri langsung dari kamus Python:

In [ ]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552868,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552868
Illinois      12882135
dtype: int64

Secara default, Seri akan dibuat di mana indeks diambil dari kunci yang diurutkan.
Dari sini, akses item bergaya kamus dapat dilakukan:

In [ ]:
population['California']

38332521

Tidak seperti kamus, Seri juga mendukung operasi gaya array seperti
mengiris:

In [ ]:
population['California':'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552868
Illinois      12882135
dtype: int64

**Constructing Series objects**

Indeks adalah argumen opsional, dan data bisa menjadi salah satu dari banyak entitas.
Misalnya, data dapat berupa daftar atau array NumPy, dalam hal ini indeks default ke urutan bilangan bulat:

In [ ]:
>>> pd.Series(data, index=index)

In [ ]:
pd.Series([2, 4, 6])

0    2
1    4
2    6
dtype: int64

data dapat berupa skalar, yang diulangi untuk mengisi indeks yang ditentukan:

In [ ]:
pd.Series(5, index=[100, 200, 300])

100    5
200    5
300    5
dtype: int64

data bisa berupa kamus, di mana indeks default ke kunci kamus yang diurutkan:

In [ ]:
pd.Series({2:'a', 1:'b', 3:'c'})

2    a
1    b
3    c
dtype: object

Dalam setiap kasus, indeks dapat disetel secara eksplisit jika hasil yang berbeda lebih disukai:

In [ ]:
pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2])

3    c
2    a
dtype: object

Perhatikan bahwa dalam kasus ini, Seri hanya diisi dengan yang diidentifikasi secara eksplisit
kunci.

**The Pandas DataFrame Object**

**DataFrame as a generalized NumPy array**

Jika Seri adalah analog dari larik satu dimensi dengan indeks fleksibel, DataFrame
adalah analog dari larik dua dimensi dengan indeks baris fleksibel dan fleksibel
nama kolom.

Untuk mendemonstrasikan ini, pertama-tama mari kita buat Seri baru yang mencantumkan luas masing-masing
lima keadaan yang dibahas di bagian sebelumnya:

In [ ]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

Sekarang kita memiliki ini bersama dengan Seri populasi dari sebelumnya, kita dapat menggunakan a
kamus untuk membuat objek dua dimensi tunggal yang berisi informasi ini:

In [ ]:
states = pd.DataFrame({'population': population,
                       'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552868  170312
Illinois      12882135  149995

Seperti objek Seri, DataFrame memiliki atribut indeks yang memberikan akses ke
label indeks:

In [ ]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

Selain itu, DataFrame memiliki atribut kolom, yang merupakan objek Indeks yang dipegang
label kolom:

In [ ]:
states.columns

Index(['population', 'area'], dtype='object')

Dengan demikian DataFrame dapat dianggap sebagai generalisasi dua dimensi
Array NumPy, di mana baris dan kolom memiliki indeks umum untuk akses mengambil data.

**DataFrame as specialized dictionary**

Demikian pula, kita juga bisa menganggap DataFrame sebagai spesialisasi kamus. Dimana
kamus memetakan kunci ke nilai, DataFrame memetakan nama kolom ke Seri
data kolom. Misalnya, meminta atribut 'area' mengembalikan objek Seri
berisi area yang kita lihat sebelumnya:

In [ ]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

**Constructing Dataframe Objects**

**Dari satu objek Seri**

 DataFrame adalah kumpulan objek Seri, dan satu kolom DataFrame dapat dibuat dari Seri tunggal:

In [ ]:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552868
Illinois      12882135

**From List of Dictionary**

Daftar kamus apa pun dapat dibuat menjadi DataFrame. Kita akan menggunakan
pemahaman daftar sederhana untuk membuat beberapa data:

In [ ]:
import pandas as pd
data = [{'a': i, 'b': 2*i}
        for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

Meskipun beberapa kunci dalam kamus hilang, Panda akan mengisinya dengan NaN (mis.,
"Bukan angka"):

In [ ]:
pd.DataFrame([{'a': 1, 'b': 2},
              {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

**From a dictionary of Series Objects**

In [ ]:
pd.DataFrame({'population': population,
              'area': area})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552868  170312
Illinois      12882135  149995

**From a two-dimensional NumPyrray**

Diberikan array data dua dimensi, kita bisa
buat DataFrame dengan kolom dan nama indeks tertentu. Jika dihilangkan, bilangan bulat
indeks akan digunakan untuk masing-masing:

In [ ]:
pd.DataFrame(np.random.rand(3, 2),
 columns=['foo', 'bar'],
 index=['a', 'b', 'c'])

        foo       bar
a  0.741493  0.871263
b  0.498055  0.913251
c  0.123482  0.442064

**From a Numpy structured array**

A Pandas DataFrame beroperasi seperti file
array terstruktur, dan dapat dibuat langsung dari satu:

In [ ]:
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [ ]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

**Objek Indeks Pandas**

Objek Indeks ini menarik
struktur itu sendiri, dan dapat dianggap sebagai larik yang tidak dapat diubah atau sebagai
set terurut (secara teknis multiset, karena objek Indeks mungkin berisi nilai yang berulang).
Pandangan tersebut memiliki beberapa konsekuensi menarik dalam operasi yang tersedia di Index
benda. Sebagai contoh sederhana, mari kita buat Indeks dari daftar bilangan bulat:

In [ ]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

**IndeksArray tidak dapat diubah**

Objek Indeks dalam banyak hal beroperasi seperti array. Misalnya, kita bisa menggunakan stan‚Äê
notasi pengindeksan dard Python untuk mengambil nilai atau irisan:

In [ ]:
ind[1]

3

In [ ]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

Objek indeks juga memiliki banyak atribut yang familiar dari array NumPy:

In [ ]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

Satu perbedaan antara objek Indeks dan array NumPy adalah bahwa indeks adalah tidak dapat diubah artinya, mereka tidak dapat dimodifikasi melalui cara biasa:

TypeError: ignored

Kekekalan ini membuatnya lebih aman untuk berbagi indeks antara beberapa DataFrame dan
array, tanpa potensi efek samping dari modifikasi indeks yang tidak disengaja.

**Index as Ordered set**

Objek Pandas dirancang untuk memfasilitasi operasi seperti penggabungan di seluruh kumpulan data,
yang bergantung pada banyak aspek himpunan aritmatika. Objek Index mengikuti banyak konvensi yang digunakan oleh struktur data set bawaan Python, sehingga persatuan, persimpangan, perbedaan, dan kombinasi lain dapat dihitung dengan cara yang familiar:

In [ ]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [ ]:
indA & indB # intersection

Int64Index([3, 5, 7], dtype='int64')

In [ ]:
indA | indB # union

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [ ]:
indA ^ indB # symmetric difference

Int64Index([1, 2, 9, 11], dtype='int64')

Operasi ini juga dapat diakses melalui metode objek. misalnya, in.intersection (imdB).

**Data Indexing and Selection**

**Data Selection in Series**

**Series as Dictionary**


Seperti kamus, objek Seri menyediakan pemetaan dari kumpulan kunci ke a
kumpulan nilai:

In [ ]:

data = pd.Series([0.25, 0.5, 0.75, 1.0],
index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [ ]:
data['b']

0.5

Kita juga dapat menggunakan ekspresi dan metode Python seperti kamus untuk memeriksa
kunci / indeks dan nilai:

In [ ]:
'a' in data

True

In [ ]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

Objek seri bahkan dapat dimodifikasi dengan sintaks seperti kamus. Seperti yang Anda bisa
memperluas kamus dengan menetapkan ke kunci baru, Anda dapat memperluas Seri dengan menetapkan
ke nilai indeks baru:

In [ ]:
data['e']=1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

Perubahan objek yang mudah ini adalah fitur yang nyaman: di bawah tenda, Pandas ada
membuat keputusan tentang tata letak memori dan penyalinan data yang mungkin perlu dilakukan
tempat; pengguna umumnya tidak perlu khawatir tentang masalah ini.

**Series as one-dimensional array**

Seri A dibangun di atas antarmuka seperti kamus ini dan menyediakan pemilihan item bergaya larik
tion melalui mekanisme dasar yang sama seperti array NumPy ‚Äî yaitu, slice, masking, dan pengindeksan mewah. Contohnya adalah sebagai berikut:

In [ ]:
# slicing by explicit index
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [ ]:
#slicing by implicit integerindex
data[0:2]

a    0.25
b    0.50
dtype: float64

In [ ]:
# masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [ ]:
#fancy indexing
data[['a','b']]

a    0.25
b    0.50
dtype: float64

**Indexers:loc,iloc, andix**

Konvensi pemotongan dan pengindeksan ini dapat menjadi sumber kebingungan. Misalnya, jika
Seri Anda memiliki indeks integer eksplisit, operasi pengindeksan seperti data [1] akan melakukannya
menggunakan indeks eksplisit, sementara operasi pemotongan seperti data [1: 3] akan menggunakan implisit
Indeks gaya Python.

In [ ]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [ ]:
#explicit index when slicing
data[1:3]

3    b
5    c
dtype: object

Pertama, atribut loc memungkinkan pengindeksan dan pemotongan yang selalu mereferensikan eksplisit
indeks:

In [ ]:
data.loc[1]

'a'

In [ ]:
data.loc[1:3]

1    a
3    b
dtype: object

**Data Selection in DataFrame**

**DataFrame as a dictionary**

In [ ]:
area = pd.Series({'California': 423967, 'Texas': 695662,
'New York': 141297, 'Florida': 170312,
'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127, 'Florida': 19552860,
'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

Seri individu yang membentuk kolom DataFrame dapat diakses
melalui pengindeksan gaya kamus dari nama kolom:

In [ ]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

Sama halnya, kita bisa menggunakan akses bergaya atribut dengan nama kolom yang berupa string:

In [ ]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

Akses kolom bergaya atribut ini sebenarnya mengakses objek yang sama persis dengan
akses bergaya kamus:

In [ ]:
data.area is data['area']

True

Misalnya, DataFrame memiliki metode pop (), jadi data.pop akan menunjuk ke ini daripada
kolom "pop":

In [ ]:
data.pop is data['pop']

False

Seperti objek Seri yang dibahas sebelumnya, sintaks gaya kamus ini juga bisa
digunakan untuk memodifikasi objek, dalam hal ini menambahkan kolom baru:

In [ ]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

**DataFrame as two-dimensional array**

Seperti disebutkan sebelumnya, kita juga dapat melihat DataFrame sebagai array dua dimensi yang disempurnakan. Kita dapat memeriksa larik data mentah yang mendasari menggunakan nilai
atribut:

In [ ]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [ ]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [ ]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [ ]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

Jadi untuk pengindeksan gaya array, kita membutuhkan konvensi lain. Di sini Panda menggunakan lagi
pengindeks loc, iloc, dan ix yang disebutkan sebelumnya. Menggunakan pengindeks iloc, kami bisa
indeks array yang mendasari seolah-olah itu adalah array NumPy sederhana (menggunakan implisit
Python-style index), tetapi indeks DataFrame dan label kolom dipertahankan di
hasil:

In [ ]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [ ]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [ ]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [ ]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [ ]:
data.iloc[0,2]=90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

**Additional Indexing Conventions**

Ada beberapa konvensi pengindeksan tambahan yang mungkin tampak bertentangan dengan pembahasan sebelumnya, namun dapat sangat berguna dalam praktiknya. Pertama, saat pengindeksan mengacu pada kolom, pemotongan mengacu pada baris:

In [ ]:
data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [ ]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [ ]:
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

**Operating on Data in Pandas**

**Ufuncs:Index Preservation**

Karena Pandas dirancang untuk bekerja dengan NumPy, semua ufunc NumPy akan bekerja
Seri Pandas dan objek DataFrame. Mari kita mulai dengan mendefinisikan Rangkaian sederhana dan
DataFrame untuk mendemonstrasikan ini:

In [ ]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [ ]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [ ]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [ ]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

**UFuncs:Index Alignment**

**Index alignment in Series**

Sebagai contoh, misalkan kita menggabungkan dua sumber data yang berbeda, dan hanya menemukan
tiga teratas negara bagian AS menurut wilayah dan tiga negara bagian AS teratas menurut populasi:

In [ ]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127}, name='population')

In [ ]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [ ]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [ ]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [ ]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

**Index aligment in DataFrame**

Jenis perataan serupa terjadi untuk kolom dan indeks saat Anda berada
melakukan operasi pada DataFrames:

In [ ]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
columns=list('AB'))
A

   A   B
0  1  11
1  5   1

In [ ]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
columns=list('BAC'))
B

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [ ]:
A+B

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

In [ ]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0   1.0  15.0  13.5
1  13.0   6.0   4.5
2   6.5  13.5  10.5

**Ufuncs : Operations Between DataFrameand Series**

Pertimbangkan satu operasi umum, di mana kami menemukan perbedaan dari a
array dua dimensi dan salah satu barisnya:

In [ ]:
df = pd.DataFrame(A, columns=list('QRST'))
 df - df.iloc[0]

In [ ]:
A = rng.randint(10, size=(3, 4))
A

array([[3, 8, 2, 4],
       [2, 6, 4, 8],
       [6, 1, 3, 8]])

In [ ]:
A-A[0]

array([[ 0,  0,  0,  0],
       [-1, -2,  2,  4],
       [ 3, -7,  1,  4]])

In [ ]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [ ]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -5  0 -6 -4
1 -4  0 -2  2
2  5  0  2  7

In [ ]:
halfrow = df.iloc[0, ::2]
halfrow

Q    3
S    2
Name: 0, dtype: int64

In [ ]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -1.0 NaN  2.0 NaN
2  3.0 NaN  1.0 NaN

**Handling Missing Data**

**Trade-Offs in Missing Data Conventions**

Dalam pendekatan masking, mask mungkin merupakan array Boolean yang sepenuhnya terpisah, atau itu
mungkin melibatkan penggunaan satu bit dalam representasi data untuk menunjukkan secara lokal
status nol dari suatu nilai.

**Missing Data in Pandas**

**None: Pythonic missing Data**

Nilai sentinel pertama yang digunakan oleh Pandas adalah None, objek tunggal Python yang sering digunakan
digunakan untuk data yang hilang dalam kode Python. Karena None adalah objek Python, maka tidak mungkin
digunakan dalam larik NumPy / Pandas sembarang, tetapi hanya dalam larik dengan tipe data
'object' (yaitu, array objek Python):

In [ ]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [ ]:
vals1.sum()

TypeError: ignored

**NaN: Missing numerical data**

Representasi data lain yang hilang, NaN (singkatan dari Not a Number), berbeda;
ini adalah nilai floating-point khusus yang dikenali oleh semua sistem yang menggunakan standar
Representasi floating-point IEEE:

In [ ]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [ ]:
1 + np.nan

nan

In [ ]:
0 + np.nan

nan

In [ ]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [ ]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

Ingatlah bahwa NaN secara khusus adalah nilai floating-point; tidak ada yang setara
Nilai NaN untuk bilangan bulat, string, atau jenis lainnya.

**NaN and None in Pandas**

In [ ]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [ ]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [ ]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

**Operating on Null Values**

 Pandas memperlakukan None dan NaN sebagai dasarnya dapat dipertukarkan untuk indintifikasi nilai yang hilang atau nol. Untuk memfasilitasi konvensi ini, ada beberapa yang berguna
metode untuk mendeteksi, menghapus, dan mengganti nilai null dalam struktur data Pandas yaitu:

isnull ()
Buat topeng Boolean yang menunjukkan nilai yang hilang

notnull ()
Kebalikan dari isnull ()

dropna ()
Kembalikan versi data yang difilter

fillna ()
Kembalikan salinan data dengan nilai yang hilang diisi atau diperhitungkan

Kami akan mengakhiri bagian ini dengan eksplorasi singkat dan demonstrasi ini
rutinitas.

**Detecting null values**

In [ ]:
data = pd.Series([1, np.nan, 'hello', None])

In [ ]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [ ]:
data[data.notnull()]

0        1
2    hello
dtype: object

**Dropping null values**

Selain masking yang digunakan sebelumnya, ada metode kemudahan, dropna ()
(yang menghapus nilai NA) dan fillna () (yang mengisi nilai NA). Untuk Seri,
hasilnya langsung:

In [ ]:
data.dropna()

0        1
2    hello
dtype: object

In [ ]:
df = pd.DataFrame([[1, np.nan, 2],
[2, 3, 5],
[np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [ ]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [ ]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [ ]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [ ]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [ ]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

Sebelum baris pertama dan terakhir telah dihapus, karena baris tersebut hanya berisi dua nilai bukan nol.

**Filling null values**

Pandas menyediakan metode fillna (), yang mengembalikan salinan larik dengan nilai null yang diganti.

**A Multiply Indexed Series**

**The Bad way**

In [ ]:
import pandas as pd
import numpy as np

index = [('California', 2000), ('California', 2010),
('New York', 2000), ('New York', 2010),
('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
18976457, 19378102,
20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [ ]:
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [ ]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

Ini memberikan hasil yang diinginkan, tetapi tidak bersih (atau seefisien untuk kumpulan data besar)
sebagai sintaks pengiris yang kami sukai di Pandas.

**The better way: Pandas MultiIndex**

In [ ]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

Jika kita mengindeks ulang seri kita dengan MultiIndex ini, kita melihat representasi hierarkis
dari data:

In [ ]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

Sekarang untuk mengakses semua data yang indeks keduanya adalah 2010, kita cukup menggunakan tombol Pan‚Äê
das mengiris notasi:

In [ ]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

**MultiIndex as extra dimension**

Metode unstack () akan dengan cepat mengubah Seri yang diindeks berganda menjadi DataFrame yang diindeks secara konvensional:

In [ ]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [ ]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [ ]:
pop_df = pd.DataFrame({'total': pop,
'under18': [9267089, 9284094,
4687374, 4318033,
5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [ ]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

**Methods of MultiIndex Creation**

Cara paling mudah untuk membuat Seri atau DataFrame yang diindeks berganda
adalah dengan hanya meneruskan daftar dua atau lebih array indeks ke konstruktor. Sebagai contoh:

In [ ]:
df = pd.DataFrame(np.random.rand(4, 2),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=['data1', 'data2'])
df

        data1     data2
a 1  0.596835  0.652149
  2  0.053438  0.857693
b 1  0.420529  0.659224
  2  0.175494  0.827376

In [ ]:
data = {('California', 2000): 33871648,
('California', 2010): 37253956,
('Texas', 2000): 20851820,
('Texas', 2010): 25145561,
('New York', 2000): 18976457,
('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

**Explicit MultiIndex constructors**

Untuk lebih banyak fleksibilitas dalam cara indeks dibuat, Anda dapat menggunakan kelas
konstruktor metode yang tersedia di pd.MultiIndex. Misalnya, seperti yang kami lakukan sebelumnya,
Anda dapat membuat MultiIndex dari daftar array sederhana, yang memberikan nilai indeks
dalam setiap level:

In [ ]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [ ]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [ ]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

Anda bisa meneruskan salah satu objek ini sebagai argumen indeks saat membuat Seri atau
DataFrame, atau ke metode indeks ulang dari Seri atau DataFrame yang ada

**MultiIndex level names**

Terkadang lebih mudah untuk memberi nama level MultiIndex. Anda bisa melakukannya
ini dengan meneruskan argumen names ke salah satu konstruktor MultiIndex di atas, atau
dengan mengatur atribut names dari index setelah fakta:

In [ ]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

**MultiIndex for columns**

Dalam DataFrame, baris dan kolom sepenuhnya simetris, dan sama seperti barisnya
dapat memiliki beberapa level indeks, kolom dapat memiliki beberapa level juga. Menipu-
Perhatikan berikut ini, yang merupakan tiruan dari beberapa data medis (agak realistis):

In [ ]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      35.0  37.5  36.0  35.0  19.0  37.0
     2      17.0  37.4  49.0  36.7  52.0  35.4
2014 1      30.0  38.4  55.0  37.3  54.0  36.3
     2      45.0  36.3  35.0  36.9  41.0  36.8

In [ ]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      36.0  35.0
     2      49.0  36.7
2014 1      55.0  37.3
     2      35.0  36.9

untuk rekaman rumit yang berisi beberapa pengukuran berlabel di beberapa
kali untuk banyak subjek (orang, negara, kota, dll.), penggunaan baris hierarki dan
kolom bisa sangat nyaman

**Indexing and Slicing a MultiIndex**

**Multiply indexed Series**

Pertimbangkan Seri populasi negara bagian yang diindeks berganda yang kita lihat sebelumnya:

In [ ]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [ ]:
pop['California', 2000]

33871648

In [ ]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [ ]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

Dengan indeks yang diurutkan, kita dapat melakukan pengindeksan parsial pada tingkat yang lebih rendah dengan meneruskan
irisan kosong di indeks pertama

In [ ]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [ ]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [ ]:
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

**Multiply indexed DataFrames**

DataFrame yang diindeks berganda berperilaku serupa. Pertimbangkan media mainan kami
cal DataFrame dari sebelumnya:

In [ ]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      35.0  37.5  36.0  35.0  19.0  37.0
     2      17.0  37.4  49.0  36.7  52.0  35.4
2014 1      30.0  38.4  55.0  37.3  54.0  36.3
     2      45.0  36.3  35.0  36.9  41.0  36.8

In [ ]:
health_data['Guido', 'HR']

year  visit
2013  1        36.0
      2        49.0
2014  1        55.0
      2        35.0
Name: (Guido, HR), dtype: float64

In [ ]:
health_data['Bob','HR']

year  visit
2013  1        35.0
      2        17.0
2014  1        30.0
      2        45.0
Name: (Bob, HR), dtype: float64

In [ ]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      35.0  36.0  19.0
2014 1      30.0  55.0  54.0

**Rearranging Multi-Indices**

**Sorted and unsorted indices**

Kita akan mulai dengan membuat beberapa data sederhana yang diindeks dengan banyak indeks
diurutkan secara leksografis:

In [ ]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.625958
      2      0.917140
c     1      0.208680
      2      0.817602
b     1      0.656689
      2      0.933808
dtype: float64

In [ ]:
try:
data['a':'b']
except KeyError as e:
print(type(e))
print(e)
<class 'KeyError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [ ]:
data = data.sort_index()
data

char  int
a     1      0.625958
      2      0.917140
b     1      0.656689
      2      0.933808
c     1      0.208680
      2      0.817602
dtype: float64

In [ ]:
data['a':'b']

char  int
a     1      0.625958
      2      0.917140
b     1      0.656689
      2      0.933808
dtype: float64

**Stacking and unstacking indices**

Seperti yang kita lihat secara singkat sebelumnya, adalah mungkin untuk mengonversi kumpulan data dari multi-indeks bertumpuk
ke representasi dua dimensi sederhana, secara opsional menentukan level yang akan digunakan:

In [ ]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [ ]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [ ]:
 pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

**Index setting and resetting**

Untuk kejelasan, kami dapat menentukan
nama data untuk representasi kolom:

In [ ]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [ ]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

**Data Aggregations on Multi-Indices**

In [ ]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      35.0  37.5  36.0  35.0  19.0  37.0
     2      17.0  37.4  49.0  36.7  52.0  35.4
2014 1      30.0  38.4  55.0  37.3  54.0  36.3
     2      45.0  36.3  35.0  36.9  41.0  36.8

In [ ]:
data_mean = health_data.mean(level='year')
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     26.0  37.45  42.5  35.85  35.5  36.20
2014     37.5  37.35  45.0  37.10  47.5  36.55

In [ ]:
data_mean.mean(axis=1, level='type')

type         HR  Temp
year
2013  34.666667  36.5
2014  43.333333  37.0

**Combining Datasets: Concat and Append**

Seri dan DataFrames dibuat dengan mempertimbangkan jenis operasi ini, dan Pandas menyertakan fungsi dan metode yang membuat data semacam ini bertengkar dengan cepat dan lugas.

**Recall: Concatenation of NumPy Arrays**

Ingatlah bahwa dengan itu, Anda dapat menggabungkan
isi dari dua atau lebih larik menjadi satu larik:

In [ ]:
x = [1, 2, 3]
y = [4, 5, 6]
z = [7, 8, 9]
np.concatenate([x, y, z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [ ]:
x = [[1, 2],
[3, 4]]
np.concatenate([x, x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

**Simple Concatenation with pd.concat**

Panda memiliki fungsi, pd.concat (), yang memiliki sintaks yang mirip dengan np.concatenate
tetapi berisi sejumlah opsi yang akan kita bahas sebentar lagi:

In [ ]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [ ]:
 df1 = make_df('AB', [1, 2])
 df2 = make_df('AB', [3, 4])
 print(df1); print(df2); print(pd.concat([df1, df2]))
df1 df2 pd.concat([df1, df2])
 A B A B A B
 1 A1 B1 3 A3 B3 1 A1 B1
 2 A2 B2 4 A4 B4 2 A2 B2
 3 A3 B3
 4 A4 B4

In [ ]:
df3 = make_df('AB', [0, 1])
 df4 = make_df('CD', [0, 1])
 print(df3); print(df4); print(pd.concat([df3, df4], axis='col'))
df3 df4 pd.concat([df3, df4], axis='col')
 A B C D A B C D
 0 A0 B0 0 C0 D0 0 A0 B0 C0 D0
 1 A1 B1 1 C1 D1 1 A1 B1 C1 D1

Kita bisa menentukan axis = 1 secara ekuivalen; di sini kami telah menggunakan yang lebih intuitif
axis = 'col'.

**Duplicate indices**

In [ ]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index # make duplicate indices!
print(x); print(y); print(pd.concat([x, y]))
x y pd.concat([x, y])

**Menangkap pengulangan sebagai kesalahan.** Jika Anda hanya ingin memverifikasi bahwa indeks di
hasil dari pd.concat () tidak tumpang tindih, Anda dapat menentukan tanda verifikasi_integrity.
Dengan set ini ke True, penggabungan akan memunculkan pengecualian jika ada duplikat
indeks. Berikut adalah contoh, di mana untuk kejelasan kami akan menangkap dan mencetak pesan kesalahan:

In [ ]:
try:
 pd.concat([x, y], verify_integrity=True)
 except ValueError as e:
 print("ValueError:", e)
ValueError: Indexes have overlapping values: [0, 1]

**Mengabaikan indeks.** Terkadang indeks itu sendiri tidak penting, dan Anda lebih suka
itu untuk diabaikan begitu saja. Anda dapat menentukan opsi ini menggunakan flag ignore_index. Dengan
ini disetel ke True, penggabungan akan membuat indeks bilangan bulat baru untuk hasilnya
Seri

In [ ]:
print(x); print(y); print(pd.concat([x, y], ignore_index=True))
x y pd.concat([x, y], ignore_index=True)
 A B A B A B
 0 A0 B0 0 A2 B2 0 A0 B0
 1 A1 B1 1 A3 B3 1 A1 B1
 2 A2 B2
 3 A3 B3

**Menambahkan kunci MultiIndex.** Alternatif lain adalah menggunakan opsi kunci untuk menentukan label
untuk sumber data; hasilnya akan menjadi seri yang diindeks secara hierarki yang berisi
data:

In [ ]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
print(df5); print(df6); print(pd.concat([df5, df6])

In [ ]:
print(df5); print(df6);
print(pd.concat([df5, df6], join='inner'))

In [ ]:
print(df5); print(df6);
print(pd.concat([df5, df6], join_axes=[df5.columns]))

**The append() method**

In [ ]:
print(df1); print(df2); print(df1.append(df2))

**Combining Datasets: Merge and Join**

**Relational Algebra**

Pandas mengimplementasikan beberapa blok penyusun fundamental ini di pd.merge ()
fungsi dan metode join () terkait dari Seri dan DataFrames. Seperti yang akan kita lihat,
ini memungkinkan Anda menautkan data secara efisien dari sumber yang berbeda.

**Categories of Joins**

**One-to-one joins**

Sebagai contoh konkret, perhatikan yang berikut ini
dua DataFrames, yang berisi informasi tentang beberapa karyawan di sebuah perusahaan:

In [ ]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
 'hire_date': [2004, 2008, 2012, 2014]})
print(df1); print(df2)

In [ ]:
df3 = pd.merge(df1, df2)
df3

**Many-to-one joins**

Gabungan banyak ke satu adalah gabungan di mana salah satu dari dua kolom kunci berisi duplikat
entri. Untuk kasus banyak-ke-satu, DataFrame yang dihasilkan akan mempertahankan dupli‚Äê
entri kategori yang sesuai. Pertimbangkan contoh gabungan banyak-ke-satu berikut:

In [ ]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
'supervisor': ['Carly', 'Guido', 'Steve']})
print(df3); print(df4); print(pd.merge(df3, df4))

**Many-to-many joins**

Dengan melakukan gabungan banyak-ke-banyak, kami dapat memulihkan keterampilan yang terkait dengan apa pun
individu orang:

In [ ]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
'Engineering', 'Engineering', 'HR', 'HR'],
'skills': ['math', 'spreadsheets', 'coding', 'linux',
'spreadsheets', 'organization']})
print(df1); print(df5); print(pd.merge(df1, df5))

**Specification of the Merge Key**

**The on keyword**

Sederhananya, Anda dapat secara eksplisit menentukan nama kolom kunci menggunakan tombol on
kata, yang mengambil nama kolom atau daftar nama kolom:

**The left_on and right_on keywords**

In [ ]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'salary': [70000, 80000, 120000, 90000]})
print(df1); print(df3);
print(pd.merge(df1, df3, left_on="employee", right_on="name"))

In [ ]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

**The left_index and right_index keywords**

In [ ]:
df1a = df1.set_index('employee')
 df2a = df2.set_index('employee')
 print(df1a); print(df2a)

In [ ]:
print(df1a); print(df2a);
print(pd.merge(df1a, df2a, left_index=True, right_index=True))

In [ ]:
print(df1a); print(df2a); print(df1a.join(df2a))

In [ ]:
print(df1a); print(df3);
print(pd.merge(df1a, df3, left_index=True, right_on='name'))

**Specifying Set Arithmetic for Joins**

In [ ]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
 'food': ['fish', 'beans', 'bread']},
 columns=['name', 'food'])
 df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
 'drink': ['wine', 'beer']},
 columns=['name', 'drink'])
 print(df6); print(df7); print(pd.merge(df6, df7))

In [ ]:
pd.merge(df6, df7, how='inner')

In [ ]:
print(df6); print(df7); print(pd.merge(df6, df7, how='outer'))

In [ ]:
print(df6); print(df7); print(pd.merge(df6, df7, how='left'))

**Overlapping Column Names: The suffixes Keyword**

In [ ]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'rank': [3, 1, 4, 2]})
 print(df8); print(df9); print(pd.merge(df8, df9, on="name"))

In [ ]:
print(df8); print(df9);
print(pd.merge(df8, df9, on="name", suffixes=["_L", "_R"]))

**Example: US States Data**

In [ ]:
pop = pd.read_csv('state-population.csv')
 areas = pd.read_csv('state-areas.csv')
 abbrevs = pd.read_csv('state-abbrevs.csv')
 print(pop.head()); print(areas.head()); print(abbrevs.head())

In [ ]:
merged = pd.merge(pop, abbrevs, how='outer',
 left_on='state/region', right_on='abbreviation')
 merged = merged.drop('abbreviation', 1) # drop duplicate info
 merged.head()

In [ ]:
 merged.isnull().any()

In [ ]:
merged[merged['population'].isnull()].head()

In [ ]:
merged.loc[merged['state'].isnull(), 'state/region'].unique()

In [ ]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
 merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
 merged.isnull().any()

In [ ]:
final = pd.merge(merged, areas, on='state', how='left')
 final.head()

In [ ]:
final.isnull().any()

In [ ]:
final['state'][final['area (sq. mi)'].isnull()].unique()

In [ ]:
final.dropna(inplace=True)
 final.head()

In [ ]:
data2010 = final.query("year == 2010 & ages == 'total'")
 data2010.head()

In [ ]:
data2010.set_index('state', inplace=True)
 density = data2010['population'] / data2010['area (sq. mi)']

In [ ]:
density.sort_values(ascending=False, inplace=True)
 density.head()

In [ ]:
density.tail()``

Kami melihat bahwa negara bagian yang paling tidak padat, sejauh ini, adalah Alaska, dengan rata-rata lebih dari satu penduduk per mil persegi.
Jenis penggabungan data yang berantakan ini adalah tugas umum saat seseorang mencoba menjawabnya
pertanyaan menggunakan sumber data dunia nyata. Saya harap contoh ini memberi kita ide tentang cara menggabungkan alat yang telah kami bahas untuk mendapatkan wawasan
data Anda!

**Aggregation and Grouping**

Bagian penting dari analisis data besar adalah peringkasan yang efisien: komputasi
agregasi seperti sum (), mean (), median (), min (), dan max (), di mana satu nomor
ber memberikan wawasan tentang sifat kumpulan data yang berpotensi besar. Di bagian ini, kita akan mempelajari agregasi di Pandas, dari operasi sederhana yang serupa dengan apa yang telah kita lihat di array NumPy, hingga operasi yang lebih canggih berdasarkan konsep groupby.

**Planets Data**

In [ ]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [ ]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

Ini memiliki beberapa detail tentang 1.000+ exoplanet yang ditemukan hingga 2014.

**Simple Aggregation in Pandas**

In [ ]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [ ]:
ser.sum()

2.811925491708157

In [ ]:
ser.mean()

0.5623850983416314

In [ ]:
df = pd.DataFrame({'A': rng.rand(5),
'B': rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [ ]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [ ]:
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

Mari kita gunakan ini pada data Planet, untuk saat ini membuang baris dengan nilai yang hilang:

In [ ]:
 planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

**GroupBy: Split, Apply, Combine**

**Split, apply, combine**

In [ ]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [ ]:
df.groupby('key')

In [ ]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

**The GroupBy object**

Objek GroupBy adalah abstraksi yang sangat fleksibel. Dalam banyak hal, Anda bisa langsung mengobatinya
seolah-olah itu adalah kumpulan DataFrames, dan melakukan hal-hal sulit di balik terpal.
Mari kita lihat beberapa contoh penggunaan data Planet.

**Pengindeksan kolom.**Objek GroupBy mendukung pengindeksan kolom dengan cara yang sama seperti
DataFrame, dan mengembalikan objek GroupBy yang dimodifikasi. Sebagai contoh:

In [ ]:
planets.groupby('method')

In [ ]:
planets.groupby('method')['orbital_period']

In [ ]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [ ]:
for (method, group) in planets.groupby('method'):
 print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

**Metode pengiriman.** Melalui beberapa sihir kelas Python, metode apa pun tidak secara eksplisit
diimplementasikan oleh objek GroupBy akan dilewati dan dipanggil ke grup,
apakah itu objek DataFrame atau Seri. Misalnya, Anda dapat menggunakan
description () metode DataFrames untuk melakukan satu set agregasi yang mendeskripsikan masing-masing
kelompok dalam data:

In [ ]:
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.0
       Eclipse Timing Variations           9.0
       Imaging                            38.0
       Microlensing                       23.0
       Orbital Brightness Modulation       3.0
                                         ...
max    Pulsar Timing                    2011.0
       Pulsation Timing Variations      2007.0
       Radial Velocity                  2014.0
       Transit                          2014.0
       Transit Timing Variations        2014.0
Length: 80, dtype: float64

**Aggregate, filter, transform, apply**

Diskusi sebelumnya berfokus pada agregasi untuk operasi gabungan, tetapi
ada lebih banyak pilihan yang tersedia. Secara khusus, objek GroupBy memiliki aggregate (),
filter (), transform (), dan apply () metode yang secara efisien mengimplementasikan berbagai
operasi yang berguna sebelum menggabungkan data yang dikelompokkan.

In [ ]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data1': range(6),
'data2': rng.randint(0, 10, 6)},
columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

**Pengumpulan.** Kita sekarang terbiasa dengan agregasi GroupBy dengan jumlah (), median (),
dan sejenisnya, tetapi metode aggregate () memungkinkan lebih banyak fleksibilitas. Ini bisa memakan waktu
string, fungsi, atau daftarnya, dan menghitung semua agregat sekaligus. Ini dia
contoh cepat yang menggabungkan semua ini:

In [ ]:
df.groupby('key').aggregate(['min', np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

Pola berguna lainnya adalah meneruskan nama kolom pemetaan kamus ke operasi
untuk diterapkan pada kolom itu:

In [ ]:
df.groupby('key').aggregate({'data1': 'min',
'data2': 'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

**Penyaringan.** Operasi pemfilteran memungkinkan Anda untuk menjatuhkan data berdasarkan kelompok yang tepat
ikatan. Misalnya, kita mungkin ingin menyimpan semua kelompok yang memiliki simpangan baku
lebih besar dari beberapa nilai kritis:

In [ ]:
def filter_func(x):
  return x['data2'].std() > 4
print(df); print(df.groupby('key').std());
print(df.groupby('key').filter(filter_func))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641
  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

**Transformasi.** Meskipun agregasi harus mengembalikan versi data yang dikurangi, trans-
formasi dapat mengembalikan beberapa versi data lengkap yang telah diubah untuk digabungkan kembali. Untuk
seperti transformasi, bentuk keluarannya sama dengan masukan. Contoh umum
adalah memusatkan data dengan mengurangi rata-rata berdasarkan kelompok:

In [ ]:
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

**Metode apply ().** Metode apply () memungkinkan Anda menerapkan fungsi arbitrer ke
hasil kelompok. Fungsi tersebut harus menggunakan DataFrame, dan mengembalikan salah satu Pandas
objek (misalnya, DataFrame, Series) atau skalar; operasi gabungan akan disesuaikan dengan
jenis keluaran yang dikembalikan.

In [ ]:
def norm_by_data2(x):
# x is a DataFrame of group values
  x['data1'] /= x['data2'].sum()
  return x
print(df); print(df.groupby('key').apply(norm_by_data2))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

In [ ]:
L = [0, 1, 0, 1, 2, 0]
print(df); print(df.groupby(L).sum())

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
   data1  data2
0      7     17
1      4      3
2      4      7

**Daftar, larik, seri, atau indeks yang menyediakan kunci pengelompokan.** Kuncinya bisa berupa seri atau daftar apa pun
dengan panjang yang cocok dengan DataFrame. Sebagai contoh:

In [ ]:
L = [0, 1, 0, 1, 2, 0]
print(df); print(df.groupby(L).sum())

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
   data1  data2
0      7     17
1      4      3
2      4      7

In [ ]:
print(df); print(df.groupby(df['key']).sum())

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
     data1  data2
key
A        3      8
B        5      7
C        7     12

**Indeks pemetaan kamus atau seri ke grup.** Cara lainnya adalah dengan menyediakan kamus
yang memetakan nilai indeks ke kunci grup:

In [ ]:
df2 = df.set_index('key')
mapping = {'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}
print(df2); print(df2.groupby(mapping).sum())

     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9
           data1  data2
consonant     12     19
vowel          3      8

In [ ]:
print(df2); print(df2.groupby(str.lower).mean())

     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9
   data1  data2
a    1.5    4.0
b    2.5    3.5
c    3.5    6.0

Daftar kunci yang valid. Selanjutnya, salah satu pilihan kunci sebelumnya dapat digabungkan menjadi
grup di multi-indeks:

In [ ]:
df2.groupby([str.lower, mapping]).mean()

             data1  data2
a vowel        1.5    4.0
b consonant    2.5    3.5
c consonant    3.5    6.0

**Contoh pengelompokan**
Sebagai contoh, dalam beberapa baris kode Python kita dapat menggabungkan semua ini
dan menghitung planet yang ditemukan dengan metode dan dekade:

In [ ]:
decade = 10 * (planets['year'] // 10)
decade = decade.astype(str) + 's'
decade.name = 'decade'
planets.groupby(['method', decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0